*** DONE [[https://github.com/kaiwk/leetcode.el][leetcode.el]]
    :LOGBOOK:
    CLOCK: [2020-03-03 Tue 11:21]--[2020-03-03 Tue 11:59] =>  0:38
    CLOCK: [2020-02-06 Thu 13:57]--[2020-02-06 Thu 13:57] =>  0:00
    :END:
  [2020-02-06 Thu 13:57]
** DONE org-brain learn to use
   :LOGBOOK:
   CLOCK: [2020-02-14 Fri 10:01]--[2020-02-14 Fri 10:02] =>  0:01
   :END:
** DONE spacemacs configuration into org-mode
   CLOSED: [2020-07-02 Thu 18:51]
   :PROPERTIES:
   :ID:       2A4C0938-EACC-49E8-9194-FC3C1A9DE441
   :END:
   :LOGBOOK:
   CLOCK: [2020-03-05 Thu 10:51]--[2020-03-05 Thu 10:51] =>  0:00
   :END:
 [2020-03-05 Thu 10:51]

 [[~/Documents/Garage/orgible/spacemacs-babel.org][babel file]]

 =C-c C-v t= to output the configuration to .spacemacs.  (org-babel-tangle)

*** org mode video [[https://www.youtube.com/watch?v=PVsSOmUB7ic][Learn Emacs Org Mode: Spacemacs Intro Tutorial - YouTube]]
    :LOGBOOK:
    CLOCK: [2020-03-02 Mon 17:48]--[2020-03-02 Mon 17:52] =>  0:04
    CLOCK: [2020-03-02 Mon 17:36]--[2020-03-02 Mon 17:47] =>  0:11
    :END:
  [2020-03-02 Mon 17:36]

**** clock in
     :LOGBOOK:
     CLOCK: [2020-07-02 Thu 17:38]--[2020-07-02 Thu 17:39] =>  0:01
     :END:
 (global-set-key (kbd "<f9> SPC") 'bh/clock-in-last-task)
**** DONE block agenda
     CLOSED: [2020-07-02 Thu 18:51]
     :LOGBOOK:
     CLOCK: [2020-07-02 Thu 17:43]--[2020-07-02 Thu 17:44] =>  0:01
     :END:
 Tasks to refile are in their own section of the block agenda. To find tasks to refile I run my agenda view with F12 SPC and scroll down to second section of the block agenda: Tasks to Refile. This view shows all tasks (even ones marked in a done state).

 Bulk refiling in the agenda works very well for multiple tasks going to the same place. Just mark the tasks with m and then B r to refile all of them to a new location. Occasionally I'll also refile tasks as subtasks of the current clocking task using C-2 C-c C-w from the refile.org file.

 Refiling all of my tasks tends to take less than a minute so I normally do this a couple of times a day.
